{ "recipes" :
	[
	{ "Name" : "Spaghetti aglio e olio",
		"Ingredients": {
		"ingNames": ["Spaghetti", "Gralic Cloves", "Olive Oil", "Chili Flakes", "Fresh Italian Parsley", "Parmigiano-Reggiano", "Lemon"],
		"ingQuantity": ["450 grams", "6", "64 ml", "1/4 teaspoon", "32 grams", "128 grams", "10ml"],
		"Instructions": {
		  "prep1" : "Bring a large pot of water to a boil. Add some salt.",
		  "prep2" : "Add the oil to a fry pan and gently heat over medium-low.",
		  "prep3" : "Peel the garlic and slice thinly (1mm).",
		  "prep4" : "Roughly chop the parsley into small pieces.",
		  "prep5" : "Finely grate the Parmigiano-Reggiano.",
		  "prep6" : "Squeeze the lemon to extract the fresh lemon juice.",
		  "step1" : "Add the spaghetti to the boiling water for 8-10 minutes. Once finished cooking, drain immediately.",
		  "step2" : "Add garlic slices to the frying pan and gently toast, stirring occasionally until golden brown.",
		  "step3" : "Add the chili flakes, salt and pepper to taste into the drained pasta.",
		  "step4" : "Pour the olive oil, garlic, parsley and half of the Parmigiano-Reggiano over the pasta.",
		  "step5" : "Stir until combined. Adjust seasoning to taste",
		  "step6" : "Serve pasta with remaining Parmigiano-Reggiano sprinkled on top."
		}
	  },
  
	  "Tags" : ["Pasta", "Spicy", "Fresh"], 
	  "Course" : "Main",
	  "NumIngredients" : 1,
	  "CostFactor" : 1,
	  "Difficulty" : 2,
	  "Time" : 240,
	  "AvgRating" : 0,
	  "Vegan": false,
	  "VeganViolation" : "Parmigiano-Reggiano",
	  "Vegetarian": false,
	  "VegViolation" : "Parmigiano-Reggiano"
	},
	{
	  "Name" : "Homemade Pizza",
	  "Ingredients": {
		"ingNames": ["Bread Flour", "Sea Salt", "Active Dry Yeast", "Water", "Olive Oil", "Garlic Cloves", "Chili Flakes", "Whole Tinned Tomatoes", "Onion Powder", "Dried Oregano", "Fresh Mozzarella Cheese", "Fresh Basil", "Semolina"],
		"ingQuantity": ["500 grams", "16 grams", "1 grams", "350 ml", "15 ml", "2", "1/4 teaspoon", "600 grams", "1/2 teaspoon", "1/2 teaspoon", "400 grams", "1 Packet", "100 grams"],
		"Instructions": {
		  "prep1" : "Dough: Combine the flour, salt, yeast and whisk together until combined.",
		  "prep2" : "Dough: Add the lukewarm water and mix together for 1-2 minutes for it to come together. Cover in plastic wrap and leave at room temperature for 18-24 hours.", 		  
		  "step1" : "Sauce: Add the oil to a frying pan on medium-low heat",
		  "step2" : "Sauce: Peel the garlic and chop roughly into small pieces.",
		  "step3" : "Sauce: Add the garlic to the frying pan and cook gently for 1 minute until fragrant but not brown. Add the chili flakes and cook for a further 20 seconds.",
		  "step4" : "Sauce: Pour in the whole tinned tomatoes and start to break them.",
		  "step5" : "Sauce: Add the onion powder and oregano and simmer for 25-30 minutes on medium heat.",
		  "step6" : "Sauce: If desired, use a hand blender to purée until smooth, alternatively squash the tomatoes in the pan until desired consistency.",
		  "step7" : "Once ready to work the dough, preheat the oven to its maximum setting for 30-40 minutes.",
		  "step8" : "Dough: Flour the work surface and start to roll the dough around to form a ball.",
		  "step9" : "Dough: Portion the dough into 4 pieces by cutting the ball.",
		  "step10" : "Dough: Sprinkle the semonlina or flour onto your baking tray and add a portion of dough to it.",
		  "step11" : "Dough: Gently shape the dough into the desired shape. Take care not to knock too much air out and do not use a rolling pin.",
		  "step12" : "Sauce: Add 2 tablespoons of the sauce to the dough and spread evenly over the pizza dough. Be relatively conservative with the sauce, try not to add more than necessary to cover.",
		  "step13" : "Rip the fresh mozzarella cheese and place onto the pizza. Aim for pools of mozzarella and try not to add too much as this can spoil the crust.",
		  "step14" : "Rip 5-6 basil leaves and top the pizza with them.",
		  "step15" : "Before placing in the oven, gently shake the baking tray to ensure the pizza will release. If it sticks, try to gently lift and add more semolina / flour.",
		  "step16" : "Place the pizza into the oven for 7-9 minutes until the cheese is golden."
		}
	  },
  
	  "Tags" : ["Pizza", "Cheese", "Italian"], 
	  "Course" : "Main",
	  "NumIngredients" : 13,
	  "CostFactor" : 2,
	  "Difficulty" : 2,
	  "Time" : 1000,
	  "AvgRating" : 0,
	  "Vegan": false,
	  "VeganViolation" : "Mozzarella Cheese",
	  "Vegetarian": true,
	  "VegViolation" : null
	}]
}